:PROPERTIES:
:ID:       8dbcae8e-77f5-4f68-8add-d8bf09fd56c9
:END:
#+title: Matèrn covariance

* Exemples:

#+begin_src R :results output :session *R* :exports both

library(bmstdr)
library(ggplot2)
library(akima)
library(tidyr)
library(RColorBrewer)
library(ggpubr)

set.seed(44)
n <- 500
x1 <- matrix(runif(2 * n), ncol = 2)
d <- as.matrix(dist(x1))
dim(d)

iidnormals <- rnorm(n)

covmat <- materncov(d, phi = 2, nu = 0.5 )

v <- exp(-d)

L <- chol(covmat)
dim(L)

y <- L %*% iidnormals
y <- scale(y, center = mean(y), scale=sd(y))
summary(y)

dplot <- data.frame(x=x1[,1], y=x1[,2], z=y)

xo <- seq(from=0, to =1, length=400)
yo <- seq(from=0, to =1, length=400)
surf <- interp(dplot$x, dplot$y, dplot$z,  xo=xo, yo=yo)

names(surf)
## [1] "x" "y" "z"
v <- list(x=surf$x, y=surf$y, z=surf$z)
# v <- fnc.delete.map.XYZ(xyz=surf)

interp1 <- data.frame(long = v$x, v$z )
names(interp1)[1:length(v$y)+1] <- v$y
interp1 <- gather(interp1,key = lat,value = field, -long,convert = TRUE)
com <- rev(c("firebrick4","firebrick2","white","dodgerblue2","dodgerblue4"))#colour palette
zr <- range(interp1$field, na.rm=T)

P <- ggplot() +
  geom_raster(data=interp1, aes(x = long, y = lat,fill = field)) +
  scale_fill_gradientn(colours=com, na.value="gray95", limits=zr)   +
  stat_contour(data=na.omit(interp1), aes(x = long, y = lat,z = field), colour = "black", binwidth =0.4) +
   theme(axis.text = element_blank(), axis.ticks = element_blank(), legend.position = "none") +
  labs(title= "Matern field with nu=0.5", x="", y="")
P

#+end_src

#+RESULTS:
#+begin_example
[1] 500 500
[1] 500 500
       V1
 Min.   :-8.877075
 1st Qu.:-0.303878
 Median : 0.008138
 Mean   : 0.000000
 3rd Qu.: 0.316981
 Max.   : 5.812364
[1] "x" "y" "z"
#+end_example

